Readme updated
